aberke/city-science-bike-swarm/nrf5_mesh/code/beaconing/src/main.c
    init.config.ble_adv_fast_enabled = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}

static void timealive_handler(void *p_context)
{
    timealive = timealive + 1;
}

static void rx_cb(const nrf_mesh_adv_packet_rx_data_t *p_rx_data)
{
    LEDS_OFF(BSP_LED_0_MASK); /* @c LED_RGB_RED_MASK on pca10031 */
    char msg[128];

    // sprintf(msg, "%02x", p_rx_data->p_payload);
    uint8_t *word = "SWARM";
    // printf("%s", p_rx_data->p_payload);
    if (strstr(p_rx_data->p_payload, word) != NULL)
    {
        //    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, " ---> Target Pack RCV\n");

        // (void) sprintf(msg, "RX [@%u]: RSSI: %3d ADV TYPE: %x ADDR: [%02x:%02x:%02x:%02x:%02x:%02x]",
        //               p_rx_data->p_metadata->params.scanner.timestamp,
        //               p_rx_data->p_metadata->params.scanner.rssi,
        //               p_rx_data->adv_type,
        //               p_rx_data->p_metadata->params.scanner.adv_addr.addr[0],
        //               p_rx_data->p_metadata->params.scanner.adv_addr.addr[1],
        //               p_rx_data->p_metadata->params.scanner.adv_addr.addr[2],
        //               p_rx_data->p_metadata->params.scanner.adv_addr.addr[3],
        //               p_rx_data->p_metadata->params.scanner.adv_addr.addr[4],
        //               p_rx_data->p_metadata->params.scanner.adv_addr.addr[5]);
        //  __LOG_XB(LOG_SRC_APP, LOG_LEVEL_INFO, msg, p_rx_data->p_payload, p_rx_data->length);

        unsigned long int rxTimeAlive = 0;

        rxTimeAlive = ((p_rx_data->p_payload[7 + 0] << 24) + (p_rx_data->p_payload[7 + 1] << 16) + (p_rx_data->p_payload[7 + 2] << 8) + (p_rx_data->p_payload[7 + 3]));
        //  printf("rxtimealive: %l ",rxTimeAlive);
        //   __NOP();
        if (rxTimeAlive > timealive)
        {
            sprintf(msg, " ---> RX %d > my timealive %d\n", rxTimeAlive, timealive);
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, msg);

            setPhase(0);
        }
    }

    //  LEDS_ON(BSP_LED_0_MASK);  /* @c LED_RGB_RED_MASK on pca10031 */
}

static void mesh_adv_init(void)
{
    advertiser_instance_init(&m_advertiser, NULL, m_adv_buffer, ADVERTISER_BUFFER_SIZE);
}

// static void mesh_adv_start(void)
// {
//     /* Let scanner accept Complete Local Name AD Type. */
//     bearer_adtype_add(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME);

//     advertiser_enable(&m_advertiser);
//     static const uint8_t adv_data[] =
//         {
//             0x06,                                /* AD data length (including type, but not itself) */
//             BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME, /* AD data type (Complete local name) */
//             'S',                                 /* AD data payload (Name of device) */
//             'W',
//             'A',
//             'R',
//             'M',
//         };

//     /* Allocate packet */
//     adv_packet_t *p_packet = advertiser_packet_alloc(&m_advertiser, sizeof(adv_data));
//     if (p_packet)
//     {
//         /* Construct packet contents */
//         memcpy(p_packet->packet.payload, adv_data, sizeof(adv_data));
//         /* Repeat forever */
//         p_packet->config.repeats = 0x01;

//         advertiser_packet_send(&m_advertiser, p_packet);
//     }

//     //   advertiser_disable(&m_advertiser);
// }

static void mesh_adv_start(void)
{

    //unsigned long timealive = millis();

    /* Let scanner accept Complete Local Name AD Type. */
    bearer_adtype_add(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME);
    advertiser_enable(&m_advertiser);
    advertiser_flush(&m_advertiser);
    uint8_t adv_data[] =
        {
            0x06 + 0x04,                         /* AD data length (including type, but not itself) 6 bytes plus sie of the long */
            BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME, /* AD data type (Complete local name) */
            'S',                                 /* AD data payload (Name of device) */
            'W',
            'A',
            'R',
            'M',
            (int)((timealive >> 8) & 0xFF),
            (int)((timealive & 0xFF)),
        };

    /* Allocate packet */
    adv_packet_t *p_packet = advertiser_packet_alloc(&m_advertiser, sizeof(adv_data));
    if (p_packet)
    {
        /* Construct packet contents */
        memcpy(p_packet->packet.payload, adv_data, sizeof(adv_data));
        /* Repeat forever */
        p_packet->config.repeats = 0x01;

        advertiser_packet_send(&m_advertiser, p_packet);
        //    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, " ---> PHASE AT ZERO packet sent  \n" );
    }
    //   __NOP();
    //    advertiser_disable(&m_advertiser);
}

static void node_reset(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, " ---> ----- Node reset -----\n");
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_RESET);
    /* This function may return if there are ongoing flash operations. */
    mesh_stack_device_reset();
}

static void config_server_evt_cb(const config_server_evt_t *p_evt)
{
    if (p_evt->type == CONFIG_SERVER_EVT_NODE_RESET)
    {
        node_reset();
    }
}

static void device_identification_start_cb(uint8_t attention_duration_s)
{
    hal_led_mask_set(LEDS_MASK, false);
    hal_led_blink_ms(BSP_LED_2_MASK | BSP_LED_3_MASK,
                     LED_BLINK_ATTENTION_INTERVAL_MS,
                     LED_BLINK_ATTENTION_COUNT(attention_duration_s));
}

